# Lista de Plugins para Antidote
# ~/.zsh_plugins.txt

# ---> Tema <---
# Starship / Powerlevel10k
# Descomentar si se va a hacer uso de Powerlevel10k
# romkatv/powerlevel10k 

# ---> Autocompletado <---
mattmc3/ez-compinit
zsh-users/zsh-completions
mattmc3/zephyr path:plugins/completion

# ---> Historial <---
mattmc3/zephyr path:plugins/history

# ---> Utilidades con fzf <---
Aloxaf/fzf-tab
lincheney/fzf-tab-completion

# ---> Plugins de Funcionalidad <---
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search

# ---> Oh My Zsh (OMZ) Plugins <---
getantidote/use-omz
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/wd
