# Lista de Plugins para Antidote
# ~/.zsh_plugins.txt

# ---> Tema <---
# Starship

# ---> Autocompletado <---
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
mattmc3/zephyr path:plugins/completion

# ---> Historial <---
mattmc3/zephyr path:plugins/history

# ---> Utilidades con fzf <---
Aloxaf/fzf-tab

# ---> Plugins de Funcionalidad <---
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search kind:defer

# ---> Oh My Zsh (OMZ) Plugins <---
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/wd
